# Shell + prompt
brew "zsh"
brew "starship"

# Dotfiles management
brew "stow"

# Modern CLI
brew "curl"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "zoxide"
brew "tree"
brew "fastfetch"

# Tool management
brew "mise"

# System monitor
brew "btop"
cask "stats"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Terminal emulator + multiplexer
brew "zellij"
cask "ghostty"

# Productivity tool
brew "delta"
brew "gh"
brew "k9s"
cask "alfred"
cask "shottr"
cask "obsidian"
cask "tailscale-app"
cask "gcloud-cli"
cask "tunnelblick"
brew "hugo"

# Security / Encryption
brew "gnupg"
brew "pinentry-mac"

# Building tool
brew "autoconf"
brew "automake"
brew "bison"
brew "pkg-config"
brew "freetype"
brew "icu4c"
brew "libzip"
brew "libxml2"
brew "re2c"
brew "gmp"
brew "libsodium"
brew "libedit"
brew "libiconv"
brew "libjpeg"

# Sass compiler
tap "dart-lang/dart"
tap "sass/sass"
brew "sass/sass/sass"

# Programming language
brew "php"

# Network protocol
brew "krb5"

# Image processing
brew "gd"
brew "imagemagick"

# Editor / IDE
brew "neovim"
cask "zed"

# Web browser
cask "google-chrome"
cask "zen"

# Container / Virtualization tool
brew "helm"
cask "orbstack"

# Communication software
cask "slack"
cask "discord"

# AI tool
brew "llm"
brew "ollama"
cask "claude"
cask "claude-code"

# Diagnostic tool
brew "mtr"
cask "wireshark-app"

# Entertainment
cask "spotify"
